import Row from "react-bootstrap/Row";
import Col from "react-bootstrap/Col";

const Spravka = () => {
  return (
    <>
      <Row className="mt-2 row justify-content-center">
        <Col md={9}>
          <h2>
            <strong>Содержание</strong>
          </h2>
          <p>
            <a href="#_Toc7536 ">
              <strong>ВВЕДЕНИЕ</strong>{" "}
            </a>
          </p>
          <p>
            <a href="#_Toc3120 ">
              <strong>ГЛАВА 1. </strong>
              <strong>
                ТЕОРЕТИЧЕСКИЕ АСПЕКТЫ В ОБЛАСТИ РАЗРАБОТКИ БАЗ ДАННЫХ
              </strong>{" "}
            </a>
          </p>
          <p>
            <a href="#_Toc14907 ">
              1.1. Основная терминология теории баз данных.{" "}
            </a>
          </p>
          <p>
            <a href="#_Toc30311 ">1.2. Анализ предметной области. </a>
          </p>
          <p>
            <a href="#_Toc3947 ">1.3. Инфологическое проектирование. </a>
          </p>
          <p>
            <a href="#_Toc14968 ">1.4. Логическое проектирование. </a>
          </p>
          <p>
            <a href="#_Toc31481 ">
              1.5. Обзор систем управления базами данных.{" "}
            </a>
          </p>

          <h1>
            <a name="_Toc7536"></a>
            <strong>ВВЕДЕНИЕ</strong>
          </h1>
          <p>
            Службы доставки еды стали очень популярными в последнее время
            благодаря своей удобной и быстрой услуге. База данных является
            важной составляющей службы доставки еды, так как позволяет управлять
            заказами, клиентскими данными, меню и другими аспектами бизнеса. В
            данном проекте будет рассмотрена разработка базы данных, которая
            позволит оптимизировать процессы работы службы доставки еды и
            улучшить качество обслуживания клиентов. В качестве примера будет
            использоваться вымышленная служба доставки еды, но представленные в
            работе принципы и подходы могут быть использованы и адаптированы для
            различных служб доставки еды.
          </p>
          <p>
            В настоящее время доставка еды стала популярным сервисом, особенно в
            свете пандемии COVID-19, когда многие рестораны перешли на режим
            только доставки. Однако управление процессом доставки еды может быть
            сложной задачей, особенно при большом количестве заказов. База
            данных является важным компонентом в любом приложении, связанном с
            обработкой информации, в том числе и для службы доставки еды.
            Разработка эффективной базы данных может значительно улучшить
            управление процессом доставки и обеспечить более высокую точность и
            быстроту обработки заказов.
          </p>
          <p>
            При разработке базы данных для службы доставки еды необходимо
            учитывать такие аспекты, как управление заказами, хранение
            информации о клиентах и ресторанах-партнерах, а также оптимизацию
            процесса доставки.
            <br />
            Таким образом, разработка базы данных для службы доставки еды имеет
            практическую значимость и может помочь улучшить процесс доставки
            еды, что в свою очередь приведет к улучшению опыта пользователей и
            увеличению прибыли для службы доставки еды.
          </p>
          <p>
            <strong>Цель курсового проекта</strong>&nbsp;- разработать базу
            данных, которая позволит эффективно управлять службой доставки еды,
            отслеживать заказы, управлять инвентарем, а также собирать и
            анализировать данные о клиентах и их заказах.
          </p>
          <p>
            Основные <strong>задачи</strong>, которые необходимо решить в рамках
            работы:
          </p>
          <ul>
            <li>Определение структуры базы данных и ее компонентов</li>
            <li>Определение функциональных требований к базе данных</li>
            <li>Создание схемы базы данных и описание таблиц</li>
            <li>
              Разработка программного интерфейса для работы с базой данных
            </li>
            <li>Тестирование и оптимизация базы данных</li>
          </ul>
          <p>
            <strong>Объектом</strong>&nbsp;исследования является процесс
            разработки базы данных с использованием конкретной СУБД.
          </p>
          <p>
            <strong>Предметом</strong>&nbsp;разработка базы службы доставки еды.
          </p>
          <p>
            <strong>Структура и объем</strong>&nbsp;курсового проекта. Курсовой
            проект состоит из введения, двух глав, заключения, списка
            использованных источников и приложений. Объем основной части
            курсового проекта составляет...
          </p>
          <p>
            Во введении описывается актуальность данной темы, цель проекта и
            основные задачи, которые необходимо решить в рамках работы. Так же
            говориться об предмете и объекте исследования.
          </p>
          <p>
            В первой главе рассматривается терминология теории баз данных, а
            также методы анализа предметной области, инфологическое и логическое
            проектирование, а также обзор и выбор систем управления базами
            данных. Данные теоретические аспекты особенно важны для создания
            эффективной базы данных для службы доставки еды.
          </p>
          <p>Во второй главе представлен...</p>
          <h1>
            <a name="_Toc90634670"></a>
            <strong>
              <a name="_Toc118391499"></a>
              <a name="_Toc3120"></a>ГЛАВА 1.{" "}
            </strong>
            <strong>
              ТЕОРЕТИЧЕСКИЕ АСПЕКТЫ В ОБЛАСТИ РАЗРАБОТКИ БАЗ ДАННЫХ
            </strong>
          </h1>
          <h2>
            <a name="_Toc90634671"></a>
            <strong>
              <a name="_Toc118391500"></a>
              <a name="_Toc14907"></a>1.1. О
            </strong>
            <strong>сновная терминология теории баз данных</strong>
            <strong>.</strong>
          </h2>
          <p>
            В современном информационном мире базы данных играют важную роль в
            организации и хранении данных. При работе с базами данных необходимо
            иметь понимание основных терминов и понятий, которые используются в
            теории баз данных. В данной главе мы рассмотрим основные термины,
            которые позволят вам понять принципы работы с базами данных и
            общаться на языке специалистов в этой области. Мы охватим такие
            термины, как база данных, таблица, поле, запись, ключ, индекс, SQL и
            многие другие. Эти термины будут полезны не только тем, кто
            занимается разработкой и администрированием баз данных, но и всем,
            кто интересуется этой областью.
          </p>
          <p>
            База данных (Database): организованная совокупность данных, которые
            упорядочены, хранятся и обрабатываются компьютерной системой.
          </p>
          <p>
            Система управления базами данных (DBMS): программное обеспечение,
            которое управляет базами данных, обеспечивает доступ к данным и
            обеспечивает их целостность и безопасность.
          </p>
          <p>
            Схема базы данных (Database schema): описание структуры базы данных,
            включающее определения таблиц, полей, связей и других атрибутов.
          </p>
          <p>
            Таблица (Table): сущность, представляющая собой упорядоченный набор
            строк и столбцов, содержащих данные.
          </p>
          <p>
            Поле (Field): отдельный элемент данных, соответствующий столбцу в
            таблице.
          </p>
          <p>
            Строка (Row): набор данных, соответствующий отдельной записи в
            таблице.
          </p>
          <p>
            Индекс (Index): структура данных, которая ускоряет процесс поиска
            данных в таблице.
          </p>
          <p>
            SQL (Structured Query Language): язык запросов, который используется
            для взаимодействия с базами данных.
          </p>
          <p>
            Транзакция (Transaction): набор операций, которые должны быть
            выполнены целиком или не выполнены вообще, чтобы поддержать
            целостность данных.
          </p>
          <p>
            Нормализация (Normalization): процесс организации данных в базе
            данных для устранения избыточности и повышения эффективности
            запросов и модификаций данных.
          </p>
          <p>
            Резервное копирование (Backup): процесс сохранения копии базы
            данных, чтобы восстановить ее в случае потери данных.
          </p>
          <p>
            &nbsp;Хранимая процедура (Stored Procedure): предварительно
            скомпилированный набор инструкций, который выполняется на стороне
            сервера базы данных для выполнения определенной функции.
          </p>
          <p>
            Ключ (Key) - столбец или набор столбцов, который уникально
            идентифицирует каждую запись в таблице. Основной ключ является
            уникальным идентификатором записи, а внешний ключ используется для
            связи таблиц между собой.
          </p>
          <p>
            Запрос - это команда или операция, которую выполняет база данных для
            получения данных, соответствующих определенному критерию или
            условию. Запросы позволяют извлекать, фильтровать, сортировать,
            группировать и объединять данные из одной или нескольких таблиц.
            Запросы могут быть написаны на специальном языке запросов, таком как
            SQL, и могут выполняться как непосредственно на сервере базы данных,
            так и на клиентской стороне.
          </p>
          <p>
            Целостность базы данных (БД) - это свойство, которое гарантирует,
            что данные в БД всегда остаются точными, надежными и
            соответствующими определенным правилам. Целостность обеспечивается с
            помощью ограничений (constraints), таких как уникальность значений,
            ограничения на ввод значений, целостность ссылочной целостности и
            т.д. Ограничения защищают БД от ошибочного ввода данных, что может
            привести к некорректным результатам при запросах или операциях
            обновления.
            <br />
            Связи между таблицами - это отношения между двумя таблицами в базе
            данных, которые устанавливаются на основе общих столбцов. Связи
            позволяют извлекать данные из двух или более таблиц с помощью одного
            запроса. Существуют различные типы связей между таблицами, такие как
            один-к-одному, один-ко-многим и многие-ко-многим.
          </p>
          <p>
            СУБД (Система управления базами данных) - программное обеспечение,
            которое используется для создания и управления базами данных. СУБД
            позволяет пользователям хранить, управлять, обрабатывать и получать
            доступ к данным в базе данных.
          </p>
          <p>
            Реляционная модель данных - это модель организации данных в базе
            данных, в которой данные представлены в виде таблиц, состоящих из
            строк и столбцов. В реляционной модели каждая таблица представляет
            собой отдельную сущность в предметной области, а каждый столбец
            таблицы представляет атрибут этой сущности.
          </p>
          <h2>
            <a name="_Toc118391501"></a>
            <strong>
              <a name="_Toc30311"></a>1.2. Анализ предметной области.
            </strong>
          </h2>
          <p>
            Службы доставки еды становятся все более популярными, особенно в
            условиях пандемии COVID-19, когда многие люди были вынуждены
            оставаться дома. Однако, чтобы организовать успешную службу доставки
            еды, необходимо понимать основные аспекты предметной области. Анализ
            предметной области позволяет определить основные потребности
            клиентов, ресторанов и служб доставки, выявить проблемы в процессе
            доставки и разработать решения для их устранения. Кроме того, анализ
            предметной области позволяет определить технические решения для
            автоматизации и управления процессом доставки.
          </p>
          <p>
            В данном контексте, анализ предметной области службы доставки еды
            имеет большое значение, так как он позволяет создать эффективный
            бизнес-план и разработать оптимальные стратегии для развития и
            улучшения услуг доставки.
          </p>
          <p>
            Служба доставки еды &ndash; это организация, которая предоставляет
            услуги по доставке еды из ресторанов и кафе до домов и офисов
            клиентов. Это удобный способ получить готовую еду без необходимости
            выхода из дома или работы.
          </p>
          <p>
            При анализе предметной области службы доставки еды необходимо
            рассмотреть следующие аспекты:
          </p>
          <p>
            Клиенты: кто они, какие у них потребности, как они могут заказывать
            еду, как часто они пользуются услугами доставки.
          </p>
          <p>
            Рестораны и кафе: какие рестораны и кафе предлагают свои услуги
            доставки еды, какие блюда они готовят, какие цены на блюда, какие
            методы оплаты принимают.
          </p>
          <p>
            Доставка: как работает процесс доставки, какой регион обслуживается,
            какие типы доставки предлагаются, какие сроки доставки, какие
            проблемы могут возникнуть при доставке.
          </p>
          <p>
            Технические решения: какие технические решения используются для
            управления процессом доставки, какие мобильные приложения и
            веб-сайты используются для заказа еды, как происходит обработка
            платежей и управление инвентаризацией.
          </p>
          <p>
            Анализ предметной области службы доставки еды позволит определить
            основные потребности клиентов и ресторанов, выявить проблемы в
            процессе доставки и разработать решения для их устранения, а также
            определить технические решения для автоматизации и управления
            процессом доставки.
          </p>
          <h2>
            <a name="_Toc118391502"></a>
            <strong>
              <a name="_Toc90634673"></a>
              <a name="_Toc3947"></a>1.3.{" "}
            </strong>
            <strong>Инфологическое проектирование</strong>
            <strong>.</strong>
          </h2>
          <p>
            Успешность компании напрямую зависит от того, насколько грамотно она
            спроектирована и организована. В этом контексте инфологическое
            проектирование играет важную роль, позволяя оптимизировать процессы,
            сократить издержки и обеспечить высокий уровень обслуживания
            клиентов. В данном тексте рассмотрим основные принципы
            инфологического проектирования службы доставки еды и его
            практическое применение в реальных условиях.
          </p>
          <p>
            Инфологическое проектирование для службы доставки еды может включать
            следующие основные сущности:
          </p>
          <p>
            Заказы: содержит информацию о заказах, включая уникальный
            идентификатор заказа, дату заказа, статус заказа и общую стоимость
            заказа.
          </p>
          <p>
            Клиенты: содержит информацию о клиентах, включая уникальный
            идентификатор клиента, имя, фамилию, адрес доставки и контактные
            данные.
          </p>
          <p>
            Рестораны: содержит информацию о ресторанах, которые принимают
            заказы, включая уникальный идентификатор ресторана, название, адрес
            и контактные данные.
          </p>
          <p>
            Меню ресторанов: содержит информацию о блюдах, которые предлагают
            рестораны, включая уникальный идентификатор блюда, название,
            описание, цену и ссылку на изображение блюда.
          </p>
          <p>
            Курьеры: содержит информацию о курьерах, которые доставляют заказы,
            включая уникальный идентификатор курьера, имя, фамилию, контактные
            данные и статус курьера.
          </p>
          <p>
            История заказов: содержит информацию об истории заказов, включая
            уникальный идентификатор заказа, уникальный идентификатор клиента,
            уникальный идентификатор ресторана, список блюд и их количество,
            дату доставки и статус доставки.
          </p>
          <p>Для этих сущностей можно определить связи, например:</p>
          <ul>
            <li>
              Каждый заказ связан с одним клиентом, одним рестораном и одним
              курьером.
            </li>
            <li>Каждый клиент может иметь множество заказов.</li>
            <li>Каждый ресторан может иметь множество блюд в своем меню.</li>
            <li>
              Каждый заказ может содержать множество блюд из меню ресторана.
            </li>
            <li>Каждый курьер может доставлять множество заказов.</li>
            <li>
              Каждый заказ может иметь множество статусов доставки в истории
              заказов.
            </li>
          </ul>
          <p>
            Также для каждой сущности можно определить атрибуты и правила
            целостности данных, чтобы обеспечить правильность и целостность
            информации в базе данных.
          </p>
          <h2>
            <a name="_Toc118391503"></a>
            <strong>
              <a name="_Toc14968"></a>1.4. Логическое проектирование.
            </strong>
          </h2>
          <p>
            Логическое проектирование базы данных (БД) - это процесс создания
            схемы БД на основе концептуальной модели данных. Оно заключается в
            трансформации концептуальной модели в форму, пригодную для создания
            физической базы данных.
          </p>
          <p>
            В процессе логического проектирования определяются сущности
            (таблицы), их атрибуты (столбцы) и связи между ними. Результатом
            логического проектирования является логическая схема БД, которая
            описывает структуру и связи между таблицами.
          </p>
          <p>
            Логическое проектирование БД является важным шагом в разработке
            информационной системы, поскольку правильно спроектированная БД
            обеспечивает эффективное хранение и обработку данных, упрощает
            доступ к информации и повышает качество работы системы в целом.
          </p>
          <p>Таблица "Клиенты":</p>
          <ul>
            <li>ID_клиента (первичный ключ)</li>
            <li>Имя</li>
            <li>Фамилия</li>
            <li>Адрес</li>
            <li>Номер телефона</li>
          </ul>
          <p>Таблица "Рестораны"</p>
          <ul>
            <li>ID_ресторана (первичный ключ)</li>
            <li>Название</li>
            <li>Адрес</li>
            <li>Координаты (долгота и широта)</li>
          </ul>
          <p>Таблица "Курьеры"</p>
          <ul>
            <li>ID_курьера (первичный ключ)</li>
            <li>Имя</li>
            <li>Фамилия</li>
            <li>Адрес</li>
            <li>Номер телефона</li>
            <li>Статус (доступен/занят)</li>
          </ul>
          <p>Таблица "Меню"</p>
          <ul>
            <li>ID_блюда (первичный ключ)</li>
            <li>Название</li>
            <li>Описание</li>
            <li>Стоимость</li>
            <li>ID_ресторана (внешний ключ)</li>
          </ul>
          <p>Таблица "Заказы"</p>
          <ul>
            <li>ID_заказа (первичный ключ)</li>
            <li>ID_клиента (внешний ключ)</li>
            <li>ID_ресторана (внешний ключ)</li>
            <li>ID_курьера (внешний ключ)</li>
            <li>Адрес доставки</li>
            <li>Сумма заказа</li>
            <li>Статус заказа (новый/в процессе/доставлен)</li>
            <li>Дата и время доставки</li>
          </ul>
          <p>
            Каждая таблица содержит информацию об определённом аспекте процесса,
            таком как информация о клиентах, ресторанах, курьерах, меню и
            заказах. Внешние ключи в таблице заказов связывают записи с
            таблицами клиентов, ресторанов и курьеров, что обеспечивает
            целостность данных и позволяет эффективно отслеживать заказы и их
            выполнение. Кроме того, в таблице ресторанов предусмотрены
            координаты, что позволяет оптимизировать процесс доставки и
            минимизировать время доставки.
          </p>
          <h2>
            <a name="_Toc31481"></a>
            <strong>1.5. Обзор систем управления базами данных.</strong>
          </h2>
          <p>
            Существует множество систем управления базами данных (СУБД), которые
            могут использоваться для хранения и обработки данных. Некоторые из
            наиболее распространённых СУБД:
          </p>
          <p>
            Oracle - это одна из самых популярных коммерческих СУБД, которая
            используется в большом количестве крупных корпоративных систем.
            Oracle предлагает широкий набор функций и высокую
            производительность, но может быть дорогим в использовании.
          </p>
          <p>
            Microsoft SQL Server - это СУБД, разработанная Microsoft, которая
            широко используется в корпоративных системах и веб-приложениях на
            платформе Windows. Она предлагает высокую производительность и
            широкий набор функций, а также интеграцию с другими продуктами
            Microsoft.
          </p>
          <p>
            PostgreSQL - это бесплатная и открытая СУБД, которая предлагает
            высокую производительность и широкий набор функций, включая
            поддержку JSON и геоданных. PostgreSQL может использоваться во
            многих сферах, от веб-приложений до научных исследований.
          </p>
          <p>
            MongoDB - это документо-ориентированная система управления базами
            данных (СУБД), которая использует формат документов BSON (бинарное
            представление JSON) для хранения данных. MongoDB позволяет хранить и
            обрабатывать большие объемы неструктурированных данных, а также
            предоставляет мощные инструменты для запросов и анализа данных. Она
            часто используется в веб-разработке, мобильных приложениях и Big
            Data-проектах.
          </p>
          <p>Мой выбор пал на MySQL по нескольким причинам.</p>
          <p>
            MySQL является одной из самых популярных систем управления базами
            данных (СУБД) и широко используется во многих сферах, включая службу
            доставки еды.
          </p>
          <p>
            MySQL имеет открытый исходный код, что позволяет пользователям
            бесплатно использовать и модифицировать программное обеспечение. Это
            особенно важно для малых и средних предприятий, которые могут
            создавать свои проекты на основе этой СУБД без необходимости платить
            за лицензии.
          </p>
          <p>
            Выбранная СУБД может обрабатывать большие объемы данных и
            поддерживать высокую скорость работы, что делает её идеальным
            выбором для проектов с высокой нагрузкой на сервер, таких как служба
            доставки еды.
          </p>
          <p>
            MySQL предлагает широкий набор функций и гибкость в настройке, что
            позволяет пользователям настроить её в соответствии с конкретными
            требованиями проекта. Например, эту СУБД можно для управления
            заказами, меню и складом.
          </p>
          <p>
            Обширная документация и сообщество поддержки делает её хорошим
            выбором для критически важных приложений, где надёжность и
            стабильность играют важную роль.
          </p>
          <p>
            Исходя из выше перечисленных преимуществ, MySQL является хорошим
            выбором для базы данных службы доставки еды. Она обладает высокой
            производительностью, гибкостью в настройке, надежностью и поддержкой
            сообщества, а также открытым исходным кодом, что делает её доступной
            для многих компаний и разработчиков. Кроме того, MySQL имеет
            возможность интеграции с различными языками программирования, что
            делает её удобной для разработки веб-приложений и взаимодействия с
            другими системами. В целом, использование MySQL для базы данных
            службы доставки еды позволяет эффективно управлять заказами, меню и
            складом, а также обрабатывать большие объемы данных и поддерживать
            высокую скорость работы, что является важным для успешной работы
            такого бизнеса.
          </p>
        </Col>
      </Row>
    </>
  );
};

export { Spravka };
